DataProcessors/КонсольИсходящихГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>КонсольИсходящихГАЗЗаявки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗадачиГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиГАЗЗаявки</Name>
			<Comment>Задачи по заявкам ГАЗ: Реестр</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресацияРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было получено обращение на автозвонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура заявки ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнение</Name>
					<Comment>Причина возврата задачи на повторое исполнение (задача не принята клиентской службой)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ГАЗЗаявки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Comment>Дата регистрации заявки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Comment>Электронная почта контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Comment>Внешний ID из системы ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/КонсольИсходящихГАЗЗаявки/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Проверка.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();

	//Роль Оформитель не должна видеть закладку "Я-исполнитель"
	//---------------------------------------------------------
	Элементы.СтрЯИсполнитель.Видимость = Ложь;
	Доступно = Истина;
	Доступно = Доступно И (		РольДоступна(Метаданные.Роли.Администратор) 
							Или РольДоступна(Метаданные.Роли.КлиентскаяСлужбаЦентр_Оператор) 
							Или РольДоступна(Метаданные.Роли.КлиентскаяСлужбаЦентр_Администратор)
							Или РольДоступна(Метаданные.Роли.КлиентскаяСлужбаРегионы_Оператор)
							) ;
	Если Доступно Тогда
		Элементы.СтрЯИсполнитель.Видимость = Истина;
	КонецЕсли;
	
	ЭтаФорма.Проверка.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Очистить();
	
	//Оформитель и клиентская служба регион видят для проверки только свои задачи
	//-----------------------------------------------------------------------------
	Доступно = Истина;
	Доступно = Доступно И (РольДоступна(Метаданные.Роли.ОформительДляВводаЗаявокГАЗ) Или  РольДоступна(Метаданные.Роли.КлиентскаяСлужбаРегионы_Оператор));
	Доступно = Доступно И Не РольДоступна(Метаданные.Роли.Администратор);
	Доступно = Доступно И Не РольДоступна(Метаданные.Роли.КлиентскаяСлужбаЦентр_Администратор);
	Доступно = Доступно И Не РольДоступна(Метаданные.Роли.КлиентскаяСлужбаЦентр_Оператор);

	Если Доступно = Истина Тогда

		ЭлОтбора = ЭтаФорма.Заявки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Автор");
		ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.ПравоеЗначение	=	ПараметрыСеанса.ТекущийПользователь;
		ЭлОтбора.Использование	=	Истина;
		
		ЭлОтбора = ЭтаФорма.Проверка.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("Автор");
		ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора.ПравоеЗначение	=	ПараметрыСеанса.ТекущийПользователь;
		ЭлОтбора.Использование	=	Истина;

	КонецЕсли;
		
	ЭлОтбора = ЭтаФорма.Проверка.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение	=	Новый ПолеКомпоновкиДанных("ДатаЗакрытия");
	ЭлОтбора.ВидСравнения	=	ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлОтбора.Использование	=	Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ДобавитьНаСервере();
КонецПроцедуры

#Область Принять
&НаСервере
Функция ПринятьНаСервере(Телефон, СигнатураЗаявкиГАЗ)
	ТекДата = ТекущаяДата();
	
	НачатьТранзакцию();
	
	Рез = РегистрыСведений.ЗадачиГАЗЗаявки.ЗакройЗадачу(Телефон, ТекДата, "", ПараметрыСеанса.ТекущийПользователь);
	Доступно = Истина;
	Доступно = Доступно И Рез = Ложь;
	Доступно = Доступно и ТранзакцияАктивна();
	Если Доступно = Истина Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	Успех = РегистрыСведений.ГАЗЗаявки.Закрыть(СигнатураЗаявкиГАЗ, ТекДата);
 	Доступно = Истина;
	Доступно = Доступно И Рез = Ложь;
	Доступно = Доступно и ТранзакцияАктивна();
	Если Доступно = Истина Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	Возврат Истина;
КонецФункции

&НаСервереБезКонтекста
Функция СигнатураЗаявкиГАЗизЗадачиЗвонка(Телефон, ДатаЗакрытия)
	Результат = "";
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Сигнатура ИЗ РегистрСведений.ЗадачиГАЗЗаявки ГДЕ Телефон = &Телефон И ДатаЗакрытия = &ДатаЗакрытия");
	Запрос.УстановитьПараметр("Телефон", 		Телефон);
	Запрос.УстановитьПараметр("ДатаЗакрытия",	 ДатаЗакрытия);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() = Ложь Тогда
		Результат = Рез.Выгрузить()[0][0];	
	КонецЕсли;	
	Возврат Результат; 
КонецФункции

&НаКлиенте
Процедура Принять(Команда)
	ТекДанные = ЭтаФорма.Элементы.Проверка.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Телефон = ТекДанные.Телефон;
	СигнатураЗаявкиГАЗ = ТекДанные.ЗаявкаГАЗ;
	Если Не ЗначениеЗаполнено(СигнатураЗаявкиГАЗ) Тогда
		// Дата постановки задачи проверки равна дате закрытия задачи звонка
		СигнатураЗаявкиГАЗ =  СигнатураЗаявкиГАЗизЗадачиЗвонка(Телефон, ТекДанные.ДатаПостановки)
	КонецЕсли;
	
	Результат = ПринятьНаСервере(Телефон , СигнатураЗаявкиГАЗ);
	Если Результат = Ложь Тогда
		ПоказатьПредупреждение(, "Ошибка приемки задачи", 3, "Ошибка");
	КонецЕсли;
	ЭтаФорма.Элементы.Проверка.Обновить();
КонецПроцедуры
#КонецОбласти

#Область Отправить_на_доработку
&НаСервере
Функция ДоработатьНаСервере(Телефон, ДатаЗакрытия, СигнатураЗаявки, Комментарий)	
	Результат = РегистрыСведений.ЗадачиГАЗЗаявки.ЗакройЗадачуПроверкиОткройЗадачуЗвонка(Телефон, ДатаЗакрытия, ПараметрыСеанса.ТекущийПользователь, СигнатураЗаявки, Комментарий);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Доработать(Команда)
	ТекДанные = ЭтаФорма.Элементы.Проверка.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ДопПарам = Новый Структура();
	ДопПарам.Вставить("Телефон", 		ТекДанные.Телефон);
	ДопПарам.Вставить("ЗаявкаГАЗ",  	ТекДанные.ЗаявкаГАЗ);
	ДопПарам.Вставить("ДатаЗакрытия",	ТекущаяДата());
	НаВводСтроки = Новый ОписаниеОповещения("НаВводСтроки", ЭтаФорма, ДопПарам);
	ПоказатьВводСтроки(НаВводСтроки, , "Введите комментарий");	
КонецПроцедуры

&НаКлиенте
Функция НаВводСтроки(Парам1, Парам2) Экспорт
	Результат = ДоработатьНаСервере(Парам2.Телефон, Парам2.ДатаЗакрытия, Парам2.ЗаявкаГАЗ, Парам1);	
	Если Результат = Ложь Тогда
		ПоказатьПредупреждение(, "Ошибка отправки задачи на доработку", 5, "Ошибка");
	КонецЕсли;
	ЭтаФорма.Элементы.Проверка.Обновить();
КонецФункции
#КонецОбласти

&НаКлиенте
Процедура Прослушать(Команда)
	ТекДанные = ЭтаФорма.Элементы.Проверка.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	Парам = Новый Структура();
	Парам.Вставить("Сигнатура", ТекДанные.ЗвонокЗакрытия);
	ОткрытьФорму("РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение", Парам, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
